from prettytable import PrettyTable

logo = r"""
 _______  _______ _________ ______   _______  _______
(  ____ \(  ____ )\__   __/(  __  \ (  ____ \(  ____ )
| (    \/| (    )|   ) (   | (  \  )| (    \/| (    )|
| (_____ | (____)|   | |   | |   ) || (__    | (____)|
(_____  )|  _____)   | |   | |   | ||  __)   |     __)
      ) || (         | |   | |   ) || (      | (\ (
/\____) || )      ___) (___| (__/  )| (____/\| ) \ \__
\_______)|/       \_______/(______/ (_______/|/   \__/"""


def printTips():
    platforms = [
        ["哔哩哔哩", "封面、视频"],
        ["唱鸭", "音频"],
        ["抖音", "无水印视频"],
        ["酷狗", "音频"],
        ["酷我", "音频"],
        ["荔枝FM", "音频"],
        ["网易云音乐", "音频、mv、视频"],
        ["QQ音乐", "音频"],
        ["皮皮搞笑", "无水印视频"],
        ["全民K歌", "音频&视频"],
        ["微博", "视频"],
        ["微视", "无水印视频"],
        ["知乎", "视频"],
        ["最右", "音频(语音帖评论)"],
        ["千千音乐", "音频"],
        ["5sing", "音频"],
        ["皮皮虾", "无水印视频"],
        ["轻视频", "无水印视频"],
        ["趣头条", "视频"],
        ["酷6网", "视频"],
        ["乐乎", "视频"],
        ["网易公开课", "视频(免费)"],
        ["新片场", "视频"],
        ["百度贴吧", "视频"],
        ["快手", "无水印视频、长图视频"],
        ["AcFun弹幕网", "视频"],
        ["百度好看视频", "视频"],
        ["梨视频", "视频"],
        ["小咖秀", "无水印视频"],
        ["搜狐视频", "视频"],
        ["土豆视频", "视频(免费电视剧等)"],
        ["TED", "视频"],
        ["图虫", "图片"],
        ["其他", "。。。"]
    ]
    table = PrettyTable(["支持平台", "支持内容"])
    for platform in platforms:
        table.add_row(platform)
    print(logo)
    print("""
    ╭━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╮
    │ @wongxy \033[36;4mhttps://github.com/xiyaowong\033[0m │
    ╰━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╯""")
    print("爬取并下载部分资源")
    print(table)


if __name__ == "__main__":
    printTips()
